SoundWaves/app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "jason"], ["password_digest", "$2a$10$oOtmKliKmxWEeypkSXFT0OlX5MM.sapfx7JJG1QrbMLWQ0mWLpOta"], ["updated_at", "2018-08-07 23:07:56.571816"], ["id", 8]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def destroy
    @user = User.find(params[:id])
    if @user == current_user
      logout!
      @user.delete