SoundWaves/app/models/user.rb

  def reset_session_token!
    self.session_token = generate_session_token
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3catuKWMtlzr3BxmNOsIog"], ["updated_at", "2018-08-07 22:04:51.797415"], ["id", 3]]

  def ensure_unique_session_token
    user = User.find_by(session_token: self.session_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "SGTbk-TBsJGAU8XrXM4fMg"], ["LIMIT", 1]]